bench/results/k6_evidence.txt
######## EVIDENCE: Scenario A baseline (single-thread, no cache) ########

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tmp/k6_native.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 254 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  01.0s/10s

running (02.0s), 50/50 VUs, 511 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  02.0s/10s

running (03.0s), 50/50 VUs, 768 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  03.0s/10s

running (04.0s), 50/50 VUs, 1017 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  04.0s/10s

running (05.0s), 50/50 VUs, 1219 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  05.0s/10s

running (06.0s), 50/50 VUs, 1453 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  06.0s/10s

running (07.0s), 50/50 VUs, 1691 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  07.0s/10s

running (08.0s), 50/50 VUs, 1931 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  08.0s/10s

running (09.0s), 50/50 VUs, 2157 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  09.0s/10s

running (10.0s), 50/50 VUs, 2391 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......: 2443    238.912382/s
    checks_succeeded...: 100.00% 2443 out of 2443
    checks_failed......: 0.00%   0 out of 2443

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=206.72ms min=4.72ms med=204.41ms max=291.67ms p(90)=229.84ms p(95)=247.49ms
      { expected_response:true }...: avg=206.72ms min=4.72ms med=204.41ms max=291.67ms p(90)=229.84ms p(95)=247.49ms
    http_req_failed................: 0.00%  0 out of 2443
    http_reqs......................: 2443   238.912382/s

    EXECUTION
    iteration_duration.............: avg=206.94ms min=5.9ms  med=204.66ms max=291.84ms p(90)=230.06ms p(95)=247.65ms
    iterations.....................: 2443   238.912382/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 625 kB 61 kB/s
    data_sent......................: 315 kB 31 kB/s



running (10.2s), 00/50 VUs, 2443 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s

######## EVIDENCE: Scenario C thread-pool + cache ########

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tmp/k6_native.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 99542 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  01.0s/10s

running (02.0s), 50/50 VUs, 217129 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  02.0s/10s

running (03.0s), 50/50 VUs, 344604 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  03.0s/10s

running (04.0s), 50/50 VUs, 479071 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  04.0s/10s

running (05.0s), 50/50 VUs, 613074 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  05.0s/10s

running (06.0s), 50/50 VUs, 747147 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  06.0s/10s

running (07.0s), 50/50 VUs, 879677 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  07.0s/10s

running (08.0s), 50/50 VUs, 1015186 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  08.0s/10s

running (09.0s), 50/50 VUs, 1140496 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  09.0s/10s

running (10.0s), 50/50 VUs, 1259578 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......: 1260231 126021.864986/s
    checks_succeeded...: 100.00% 1260231 out of 1260231
    checks_failed......: 0.00%   0 out of 1260231

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=353.23µs min=20µs    med=270µs    max=65.14ms p(90)=674µs    p(95)=902µs
      { expected_response:true }...: avg=353.23µs min=20µs    med=270µs    max=65.14ms p(90)=674µs    p(95)=902µs
    http_req_failed................: 0.00%   0 out of 1260231
    http_reqs......................: 1260231 126021.864986/s

    EXECUTION
    iteration_duration.............: avg=390.51µs min=30.08µs med=297.83µs max=66.46ms p(90)=727.37µs p(95)=977µs
    iterations.....................: 1260231 126021.864986/s
    vus............................: 50      min=50           max=50
    vus_max........................: 50      min=50           max=50

    NETWORK
    data_received..................: 329 MB  33 MB/s
    data_sent......................: 163 MB  16 MB/s



running (10.0s), 00/50 VUs, 1260231 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s